---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition
source: html/99af3446-df1c-e57c-0e92-e79888afd4d8.htm
---
# ElectricalDemandFactorDefinition Members

Constructs a new ElectricalDemandFactorDefinition with default settings.